

CREATE TABLE IF NOT EXISTS `T_CODE_RULE` (
  `code` varchar(11) NOT NULL,
  `entity` varchar(10) NOT NULL,
  PRIMARY KEY (`code`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;




INSERT INTO `T_CODE_RULE` (`code`, `entity`) VALUES
('001', '危险品铁桶'),
('002', '危险品塑料桶'),
('003', '危险品吨桶'),
('004', '危险品吨袋'),
('005', '危险品纸板桶'),
('006', '危险品25KG/包'),
('007', '危险品50KG/包'),
('008', '危险品小桶'),
('009', '危险品'),
('010', '气体'),
('011', '普货'),
('012', '整车危险品'),
('013', '整车普货'),

('014', '泡货'),
('015', '零担'),
('016', '设备'),
('017', '超宽超长大件'),
('018', '农产品'),
('019', '水产品'),
('100', '平板半挂车'),
('101', '高栏半挂车'),
('102', '半飞翼半挂车'),

('103', '全飞翼半挂车'),
('104', '高低板半挂车'),
('105', '平板9.6米'),
('106', '平板7.5米'),
('107', '高栏9.6米'),
('108', '高栏7.5米'),
('109', '重型货车>14t'),
('110', '6t<中型货车<14'),

('111', '2t<轻型货车<6t'),
('112', '微型货车<2t'),
('113', '集装箱'),
('114', '大件车辆'),
('115', '槽罐车'),
('116', '保温车'),
('117', '冷藏车'),
('118', '牵引车'),
('119', '吊车'),
('120', '叉车'),
('121', '轿运车'),

('122', '大巴车'),
('200', '吨'),
('201', '方'),
('202', '桶'),
('203', '只'),
('204', '米'),
('205', '辆'),
('300', '货到付款'),
('301', '回单付款'),
('302', '现付'),
('303', '到付');
